#Global 
token = '' #Токен бота

prefix = '>' #Префикс бота

serverid = 728983473511202856 #Ейди сервера

channelid = 729472803106979943 #Ейди канала для логов

muteroleid = 728993845014036652 #Ейди мут роли

newplayerroleid = 729129298375737355 #Ейди роли для новичков



#Vime world

code1 = "https://mc.vimeworld.ru/launcher/skins/"

code2 = ".png"

code3 = "https://mc.vimeworld.ru/launcher/cloaks/"

# Words
hello_words = [ 'hello', 'hi', 'привет' ]
answer_words = [ 'узнать информацыю о сервере', 'сервер статус', 'информацыя', 'info', 'инфа' ]
goodbye_words = [ 'пока', 'до завтра', 'bb', 'споки', 'спокойной ночи']
bad_words = [ '', ]

hello_words_msg = 'Привет друг'

answer_words_msg = 'Сервер был создан администратором Archangel . Меня зовут Юи я пикси проводник . Узнать больше пишы >help . '

goodbye_words_msg = 'Пока удачи тебе!'

bad_words_msg = 'нельзя такое писать!!!'

#Reinbow role

rainbowrolename = "RainBow" #Название радужной роли

delay = 62 #Скорость смены цвета (Есле поставить скорость ниже , то бота забанит дискорд)

#Color name

POST_ID = 729670963016237156 # id сообщения

ROLES = {
	'🟠': 729666514831278170, # Orange
	'🟣': 729666669827326013, # Purple
	'⚫': 729666729835495435, # Black
	'🔵': 729667279020884018, # Blue
	'🟤': 729667128688640042, # Brown
	'🟡': 729667867741782157, # Yellow
	'⚪': 729668077029163109, # White
    '🟢': 729668272089202788, # Green
    '🔴': 729668403140362261, # Red
}

# exclude this roles from counting
EXCROLES = ()

MAX_ROLES_PER_USER = 100 # max ammount of roles a user can have
























